wiki/ruby.org
#+TITLE:       ruby.org
#+AUTHOR:      Will Chang
#+EMAIL:       changwei.cn@gmail.com
#+DATE:        2013-12-19 Thu
#+URI:         /wiki/html/ruby
#+KEYWORDS:    ruby
#+TAGS:        :ruby:
#+LANGUAGE:    en
#+OPTIONS:     H:3 num:nil toc:nil \n:nil ::t |:t ^:nil -:nil f:t *:t <:t
#+DESCRIPTION:  Learning ruby 


* 数学计算

 1. [[http://www.kuqin.com/rubycndocument/man/built-in-class/module_math.html][Ruby参考]]

在计算三角函数sina，cos，或者各种指数，平方根时，必须在程序前面加上include Math这一句话。sin值可以用sina方法求的，平方根可以用sprt
方法求的。

下面，让我们尝试计算3的平方： 

3**2

在Ruby语言中，**表示幂运算。那么如何计算平方根呢？ 




<#+BEGIN_SRC >

include Math
print("sin(3.14)=",sin(3.14),"\n")
print("cos(3.14)=",cos(3.14),"\n")
print("sqrt(10000)=",sqrt(10000),"\n")
#+END_SRC

----
 -  [[http://express.engineyard.com/][Could computing with ruby and erlang]]
 -  [[http://antoniocangiano.com/2008/02/08/essential-guide-to-the-ruby-driver-for-db2/][ Ruby and DB2]]
 -  [[http://antoniocangiano.com/rubypython-and-db2-drivers/][Guide to setting up the IBM Ruby and Python drivers for DB2 on Linux (32 or 64 bit)]]
 -  
 -  [[http://olabini.com/blog/2008/09/language-generation/][AI in ruby]] 
 -  ruby的gems有 [[www.ruby-toolbox.com]] 
 -  rails的plugins有 [[agilewebdevelopment.com/plugins]]

* ruby differ

http://github.com/pvande/differ

#+BEGIN_SRC
will@will-laptop:~/Desktop/diff$ irb -rubygems
irb(main):001:0> irb -rubygems
NameError: undefined local variable or method `rubygems' for main:Object
	from (irb):1
irb(main):002:0> require 'differ'
=> true
irb(main):003:0> @original = "Epic lolcat fail!"
=> "Epic lolcat fail!"
irb(main):004:0>   @current  = "Epic wolfman fail!"
=> "Epic wolfman fail!"
irb(main):005:0> @diff = Differ.diff_by_line(@current, @original)
=> #<Differ::Diff:0xb75103a8 @raw=[{"Epic lolcat fail!" >> "Epic wolfman fail!"}]>
irb(main):006:0> require 'differ/string'
=> true
irb(main):007:0> @diff = (@current - @original)
=> #<Differ::Diff:0xb750a110 @raw=[{"Epic lolcat fail!" >> "Epic wolfman fail!"}]>
irb(main):008:0>   @diff.format_as(:color)
=> "\e[31mEpic lolcat fail!\e[0m\e[32mEpic wolfman fail!\e[0m"
irb(main):009:0>   @diff.format_as(:html)
=> "<del class=\"differ\">Epic lolcat fail!</del><ins class=\"differ\">Epic wolfman fail!</ins>"
irb(main):010:0> $; = ' '
=> " "
irb(main):011:0> @diff = (@current - @original)
=> #<Differ::Diff:0xb74fdc44 @raw=["Epic ", {"lolcat" >> "wolfman"}, " fail!"]>
irb(main):012:0>   @diff.format_as(:html)
=> "Epic <del class=\"differ\">lolcat</del><ins class=\"differ\">wolfman</ins> fail!"
irb(main):013:0> $; = ';'
=> ";"
irb(main):014:0> @diff = (@current - @original)
=> #<Differ::Diff:0xb74f3014 @raw=[{"Epic lolcat fail!" >> "Epic wolfman fail!"}]>
irb(main):015:0> 

#+END_SRC

* Execute cmd and get the output

IO.popen("help") {|d| d.readlines.each {|x|puts x} } 



