wiki/html/ruby/index.html
<!DOCTYPE html>
<html lang="en-us">
<head>
  <title>ruby.org - Keep going</title>
  <meta charset="utf-8" />
  <meta name="author" content="Will Chang" />
    <meta name="description" content="Learning ruby " />
    <meta name="keywords" content="ruby" />

  <link rel="stylesheet" href="http://standino.github.io/media/css/main.css" type="text/css">
  <link rel="stylesheet" href="http://standino.github.io/media/css/prettify.css" type="text/css">

  <link rel="stylesheet" href="/media/css/prettify.css" type="text/css">
  <link rel="stylesheet" href="/media/css/main.css" type="text/css">

  <link rel="stylesheet" href="../../../media/css/main.css" type="text/css">
  <link rel="stylesheet" href="../../../media/css/prettify.css" type="text/css">

</head>
  <body class="container">
    <div>
      <header class="masthead">
        <h1 class="masthead-title"><a href="/">Keep going</a></h1>
        <p>努力超越自己！</p>
        <ul>
          <li><a href="/blog/">Blog</a></li>
          <li><a href="/html/">Html</a></li>
          <li><a href="/media/">Media</a></li>
          <li><a href="/tags/">Tags</a></li>
          <li><a href="/wiki/">Wiki</a></li>
          <li><a href="/tags/">Tags</a></li>
          <li><a href="/about/">About</a></li>
          <li><a href="https://github.com/standino">GitHub</a></li>
          <li><a href="/rss.xml">RSS</a></li>
        </ul>
        <form method="get" id="searchform" action="http://www.google.com/search">
          <input type="text" class="field" name="q" id="s" placeholder="Search">
          <input type="hidden" name="q" value="site:standino.github.io">
        </form>
      </header>
    </div>

<div>
<div class="post">
<h1>ruby.org</h1>


<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1">数学计算</h2>
<div class="outline-text-2" id="text-1">
<ol class="org-ol">
<li><a href="http://www.kuqin.com/rubycndocument/man/built-in-class/module_math.html">Ruby参考</a>
</li>
</ol>

<p>
在计算三角函数sina，cos，或者各种指数，平方根时，必须在程序前面加上include Math这一句话。sin值可以用sina方法求的，平方根可以用sprt
方法求的。
</p>

<p>
下面，让我们尝试计算3的平方： 
</p>

<p>
3**2
</p>

<p>
在Ruby语言中，**表示幂运算。那么如何计算平方根呢？ 
</p>




<p>
&lt;#+BEGIN_SRC &gt;
</p>

<p>
include Math
print("sin(3.14)=",sin(3.14),"\n")
print("cos(3.14)=",cos(3.14),"\n")
print("sqrt(10000)=",sqrt(10000),"\n")
#+END_SRC
</p>

<p>
----
</p>
<ul class="org-ul">
<li><a href="http://express.engineyard.com/">Could computing with ruby and erlang</a>
</li>
<li><a href="http://antoniocangiano.com/2008/02/08/essential-guide-to-the-ruby-driver-for-db2/"> Ruby and DB2</a>
</li>
<li><a href="http://antoniocangiano.com/rubypython-and-db2-drivers/">Guide to setting up the IBM Ruby and Python drivers for DB2 on Linux (32 or 64 bit)</a>
</li>
<li></li>
<li><a href="http://olabini.com/blog/2008/09/language-generation/">AI in ruby</a> 
</li>
<li>ruby的gems有 <i>www.ruby-toolbox.com</i> 
</li>
<li>rails的plugins有 <i>agilewebdevelopment.com/plugins</i>
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2">ruby differ</h2>
<div class="outline-text-2" id="text-2">
<p>
<a href="http://github.com/pvande/differ">http://github.com/pvande/differ</a>
</p>

<pre class="example">
will@will-laptop:~/Desktop/diff$ irb -rubygems
irb(main):001:0&gt; irb -rubygems
NameError: undefined local variable or method `rubygems' for main:Object
	from (irb):1
irb(main):002:0&gt; require 'differ'
=&gt; true
irb(main):003:0&gt; @original = "Epic lolcat fail!"
=&gt; "Epic lolcat fail!"
irb(main):004:0&gt;   @current  = "Epic wolfman fail!"
=&gt; "Epic wolfman fail!"
irb(main):005:0&gt; @diff = Differ.diff_by_line(@current, @original)
=&gt; #&lt;Differ::Diff:0xb75103a8 @raw=[{"Epic lolcat fail!" &gt;&gt; "Epic wolfman fail!"}]&gt;
irb(main):006:0&gt; require 'differ/string'
=&gt; true
irb(main):007:0&gt; @diff = (@current - @original)
=&gt; #&lt;Differ::Diff:0xb750a110 @raw=[{"Epic lolcat fail!" &gt;&gt; "Epic wolfman fail!"}]&gt;
irb(main):008:0&gt;   @diff.format_as(:color)
=&gt; "\e[31mEpic lolcat fail!\e[0m\e[32mEpic wolfman fail!\e[0m"
irb(main):009:0&gt;   @diff.format_as(:html)
=&gt; "&lt;del class=\"differ\"&gt;Epic lolcat fail!&lt;/del&gt;&lt;ins class=\"differ\"&gt;Epic wolfman fail!&lt;/ins&gt;"
irb(main):010:0&gt; $; = ' '
=&gt; " "
irb(main):011:0&gt; @diff = (@current - @original)
=&gt; #&lt;Differ::Diff:0xb74fdc44 @raw=["Epic ", {"lolcat" &gt;&gt; "wolfman"}, " fail!"]&gt;
irb(main):012:0&gt;   @diff.format_as(:html)
=&gt; "Epic &lt;del class=\"differ\"&gt;lolcat&lt;/del&gt;&lt;ins class=\"differ\"&gt;wolfman&lt;/ins&gt; fail!"
irb(main):013:0&gt; $; = ';'
=&gt; ";"
irb(main):014:0&gt; @diff = (@current - @original)
=&gt; #&lt;Differ::Diff:0xb74f3014 @raw=[{"Epic lolcat fail!" &gt;&gt; "Epic wolfman fail!"}]&gt;
irb(main):015:0&gt;
</pre>
</div>
</div>

<div id="outline-container-sec-3" class="outline-2">
<h2 id="sec-3">Execute cmd and get the output</h2>
<div class="outline-text-2" id="text-3">
<p>
IO.popen("help") {|d| d.readlines.each {|x|puts x} } 
</p>
</div>
</div>
