wiki/html/ruby/index.html



<div id="outline-container-sec-4" class="outline-2">
<h2 id="sec-4">Ruy gem</h2>
<div class="outline-text-2" id="text-4">
<p>
<a href="http://rubygems.org/read/chapter/5">http://rubygems.org/read/chapter/5</a>
<a href="http://www.hhtong.com/blog1/articles/2007/06/10/ruby-gpgen-20070603">http://www.hhtong.com/blog1/articles/2007/06/10/ruby-gpgen-20070603</a>
</p>

<pre class="example">
gem install gem_plugin 
gpgen easywebtest
</pre>

<p>
RubyGems是一个库和程序的标准化打包以及安装框架，它使定位、安装、升级和卸载Ruby包变的很容易。rails以及它的大部分插件都是以gem形式发布的。本文描述一个自己创建ruby Gems的过程。
    假设你今天用ruby实现了一个stack结构，你想发布到网上让别人可以共享，OK，工作开始了。首先你的程序当然要先写好了：
Ruby代码
</p>

<ol class="org-ol">
<li>#stacklike.rb  
</li>
<li>module Stacklike  
</li>
<li>attr_reader:stack  
</li>
<li>def initialize  
</li>
<li>@stack=Array.new  
</li>
<li>end  
</li>
<li>def add_to_stack(obj)  
</li>
<li>@stack.push(obj)  
</li>
<li>end   
</li>
<li>def take_from_stack  
</li>
<li>@stack.pop  
</li>
<li>end  
</li>
<li>def size  
</li>
<li>@stack.length  
</li>
<li>end  
</li>
<li>alias length size  
</li>
<li></li>
<li>def clear  
</li>
<li>@stack.clear  
</li>
<li>end  
</li>
<li>end        
</li>
</ol>

<p>
#stacklike.rb
module Stacklike
 attr_reader:stack
 def initialize
    @stack=Array.new
 end
 def add_to_stack(obj)
    @stack.push(obj)
 end 
 def take_from_stack
    @stack.pop
 end
 def size
    @stack.length
 end
 alias length size
</p>

<p>
 def clear
   @stack.clear
 end
end      
</p>


<p>
然后就是我们的Stack类，引入这个Module，请注意，我们这里只是特意这样做，增加点复杂度：
Ruby代码
</p>

<ol class="org-ol">
<li>#stack.rb  
</li>
<li>require 'stacklike'  
</li>
<li>class Stack  
</li>
<li>include Stacklike  
</li>
<li>end  
</li>
</ol>

<p>
#stack.rb
require 'stacklike'
class Stack
 include Stacklike
end
</p>


<p>
作为一个要被"大众"使用的小程序，一定要有完备的测试代码，OK,ruby内置了单元测试库，我们来写个单元测试来测试Stack：
Ruby代码
</p>

<ol class="org-ol">
<li>require 'stack'  
</li>
<li>require 'test/unit'  
</li>
<li>class TestStack &lt;Test::Unit::TestCase  
</li>
<li>def testStack  
</li>
<li>stack=Stack.new  
</li>
<li>assert_equal(0,stack.size)  
</li>
<li>assert_equal(stack.length,stack.size)   
</li>
<li>stack.add_to_stack(1)  
</li>
<li>assert_equal(1,stack.length)  
</li>
<li>assert_equal(1,stack.take_from_stack)  
</li>
<li></li>
<li>stack.clear  
</li>
<li>assert_equal(0,stack.length)  
</li>
<li>assert_nil(stack.take_from_stack)  
</li>
<li></li>
<li>10.times{|i| stack.add_to_stack(i)}  
</li>
<li>assert_equal(10,stack.size)  
</li>
<li>assert_equal(stack.length,stack.size)  
</li>
<li>9.downto(4){|i| assert_equal(i,stack.take_from_stack)}   
</li>
<li></li>
<li>assert_equal(4,stack.length)  
</li>
<li>assert_equal(3,stack.take_from_stack)  
</li>
<li>assert_equal(3,stack.length)  
</li>
<li></li>
<li>stack.clear  
</li>
<li>assert_equal(0,stack.length)  
</li>
<li>assert_nil(stack.take_from_stack)  
</li>
<li>end  
</li>
<li>end  
</li>
</ol>

<p>
require 'stack'
require 'test/unit'
class TestStack &lt;Test::Unit::TestCase
  def testStack
    stack=Stack.new
    assert_equal(0,stack.size)
    assert_equal(stack.length,stack.size) 
    stack.add_to_stack(1)
    assert_equal(1,stack.length)
    assert_equal(1,stack.take_from_stack)
</p>

<p>
stack.clear
assert_equal(0,stack.length)
assert_nil(stack.take_from_stack)
</p>

<p>
10.times{|i| stack.add_to_stack(i)}
assert_equal(10,stack.size)
assert_equal(stack.length,stack.size)
9.downto(4){|i| assert_equal(i,stack.take_from_stack)} 
</p>

<p>
assert_equal(4,stack.length)
assert_equal(3,stack.take_from_stack)
assert_equal(3,stack.length)
</p>

<p>
    stack.clear
    assert_equal(0,stack.length)
    assert_nil(stack.take_from_stack)
  end
end
</p>


<p>
如果你使用radrails或者RDT运行这段代码，你将看到让人舒服的greenbar，一切正常。程序写好了，接下来就是关键步骤了，怎么发布成ruby Gems呢？
</p>

<p>
第一步，写Gems规范文件
   gemspec是ruby或者YAML形式的元数据集，用来提供这个gem的关键信息，我们创建一个文件夹就叫stack，然后在下面建立2个目录两个文件：
lib目录：用于存放库的源代码，比如这个例子中的stack.rb,stacklike.rb
test目录：用于存放单元测试代码。
README文件：描述你的库的基本信息和版权许可证等
stack.gemspec：gems规范文件，用以生成gem
当然，也可以有docs目录用以存放rdoc文档和ext目录用以存放ruby扩展，我们这个简单例子就免了。
看看我们的规范文件：
Ruby代码
</p>

<ol class="org-ol">
<li>#stack.spec  
</li>
<li>require 'rubygems'  
</li>
<li>SPEC=Gem::Specification.new do |s|  
</li>
<li>s.name="Stack"  
</li>
<li>s.version='0.01'  
</li>
<li>s.author='dennis zane'  
</li>
<li>s.email="killme2008@gmail.com"  
</li>
<li>s.homepage="<a href="http://www.rubyeye.net">http://www.rubyeye.net</a>"  
</li>
<li>s.platform=Gem::Platform::RUBY  
</li>
<li>s.summary="ruby实现的Stack"  
</li>
<li>condidates =Dir.glob("{bin,lib,docs,test}/**/*")  
</li>
<li>s.files=condidates.delete_if do |item|  
</li>
<li>item.include?("CVS")|| item.include?("rdoc")  
</li>
<li>end  
</li>
<li>s.require_path="lib"  
</li>
<li>s.autorequire='stack,stacklike'  
</li>
<li>s.test_file="test/ts_stack.rb"  
</li>
<li>s.has_rdoc=false  
</li>
<li>s.extra_rdoc_files=["README"]  
</li>
<li>end    
</li>
</ol>

<pre class="example">
#stack.spec
require 'rubygems'
SPEC=Gem::Specification.new do |s|
  s.name="Stack"
  s.version='0.01'
  s.author='dennis zane'
  s.email="killme2008@gmail.com"
  s.homepage="http://www.rubyeye.net"
  s.platform=Gem::Platform::RUBY
  s.summary="ruby实现的Stack"
  condidates =Dir.glob("{bin,lib,docs,test}/**/*")
  s.files=condidates.delete_if do |item|
    item.include?("CVS")|| item.include?("rdoc")
  end
  s.require_path="lib"
  s.autorequire='stack,stacklike'
  s.test_file="test/ts_stack.rb"
  s.has_rdoc=false
  s.extra_rdoc_files=["README"]
end
</pre>

<p>
很明显，规范文件也是ruby程序（也可以用YAML描述），设置了这个gem的主要关键信息：名称、作者信息、平台,需要注意的就是files 数组过滤掉了cvs和rdoc文件，require_path和auto_require让你指定了require_gem装入gem时会被添加到$ LOAS_PATH（ruby查找库的路径）中的目录（也就是我们源代码存放的lib），auto_require指定了装载的文件名，我们没有 rdoc，所有设置has_rdoc为false，附带文档就是README。
</p>

<p>
第二步 修改单元测试文件引用路径
过去我们假设ts_stack.rb与stack.rb、stacklike.rb在同一个目录下，可是我们现在将它们分别放在lib和test目录，TestStack 怎么引用测试的类呢？答案是在ts_stack.rb开头加上一行：
Ruby代码
</p>

<ol class="org-ol">
<li>$:.unshift File.join(File.dirname(<span class="underline"><span class="underline">FILE</span></span>),"..","lib")  
</li>
</ol>

<p>
$:.unshift File.join(File.dirname(<span class="underline"><span class="underline">FILE</span></span>),"..","lib")
</p>


<p>
最后一步 构建gem
在stack目录执行下列命令：
Ruby代码
</p>

<ol class="org-ol">
<li>ruby stack.gemspec  
</li>
</ol>

<p>
ruby stack.gemspec
</p>


<p>
或者:
Ruby代码
</p>

<ol class="org-ol">
<li>gem build stack.gemspec  
</li>
</ol>

<p>
gem build stack.gemspec
</p>


<p>
将生成一个文件，你可以将这个文件共享给朋友们咯。你的朋友只要下载这个文件，执行：
Ruby代码
</p>

<ol class="org-ol">
<li>gem install Stack.0.01.gem  
</li>
</ol>

<p>
gem install Stack.0.01.gem
</p>


<p>
将在他们的ruby环境中安装你写的stack，比较遗憾的是，你这个stack确实太简陋了，哈哈。 
</p>
</div>
</div>


<div id="outline-container-sec-5" class="outline-2">
<h2 id="sec-5">web server</h2>
<div class="outline-text-2" id="text-5">
<p>
<a href="http://snippets.dzone.com/tag/webrick">http://snippets.dzone.com/tag/webrick</a>
</p>


<ul class="org-ul">
<li>Ruby send mail with attathment
</li>
</ul>

<p>
 &lt;#+BEGIN_SRC &gt;
 gem install actionmailer
 gem install mime-types
#+END_SRC
</p>
</div>
</div>

<div id="outline-container-sec-6" class="outline-2">
<h2 id="sec-6">Ruby dummy mail server</h2>
<div class="outline-text-2" id="text-6">
<p>
&lt;#+BEGIN_SRC &gt;
  gem sources -a <a href="http://gems.github.com">http://gems.github.com</a>
  gem install koseki-mocksmtpd
cd ~/.gem/ruby/1.8/bin
  ./mocksmtpd  init ~/testmail
  sudo ./mocksmtpd -f ~/testmail/mocksmtpd.conf 
#+END_SRC
</p>

<p>
send mail to test@changweilaptop.dyn.webahead.ibm.com
</p>

<p>
You will get the mail in  <a href="file:///home/will/testmail/inbox/index.html">file:///home/will/testmail/inbox/index.html</a>
</p>

<p>
But the mail body is not readable.
</p>
</div>
</div>
