wiki/ruby.org
* Ruby to exe

http://rubyforge.org/projects/ocra 

http://github.com/larsch/ocra 

（水果党和 linuser 先站一边去 ……） 
One-Click Ruby Application，就是把解释器、gem 什么的打包在一起做成独立 exe。 
  比 rubyscript2exe 和 exerb 先进，支持 1.9。 

安装： 
Console代码 
gem install ocra  

或者下载 stand alone not complex 的 .exe 

假设要把 testo.rb 做成 exe，只需： 
Console代码 
ocra.rb.bat testo.rb  


输出看起来像这样（它把用到的东西都打包到 exe 里面了）： 
=== Loading script to check dependencies 
testo vooo 
=== Building testo.exe 
m #+BEGIN_SRC  
a #+BEGIN_SRC  
m bin 
a bin\ruby.exe 
a bin\msvcr100-ruby191.dll 
a bin\MSVCR100.dll 
m lib 
m lib\ruby 
m lib\ruby\1.9.1 
m lib\ruby\1.9.1\i386-mswin32_100 
m lib\ruby\1.9.1\i386-mswin32_100\enc 
a lib\ruby\1.9.1\i386-mswin32_100\enc\encdb.so 
a lib\ruby\1.9.1\i386-mswin32_100\enc\euc_kr.so 
a lib\ruby\1.9.1\i386-mswin32_100\enc\gb2312.so 
m lib\ruby\1.9.1\i386-mswin32_100\enc\trans 
a lib\ruby\1.9.1\i386-mswin32_100\enc\trans\transdb.so 
a lib\ruby\1.9.1\i386-mswin32_100\enc\gbk.so 
a lib\ruby\1.9.1\rubygems.rb 
e RUBYOPT rubygems 
e RUBYLIB 
l bin\ruby.exe ruby.exe  \#+BEGIN_SRC  
=== Compressing 
=== Finished (Final size was 781622) - 只有 781k 的 standalone 

一些琐碎的东西： 

   
 ocra 之前，路径变量中应该包含 ruby_home\bin，ocra 是根据 path 中找到的第一个 ruby 解释器来决定库文件位置的。设定路径变量例：
Console代码 
set path=d:\Ruby\ruby1.9.1\bin;%path%  


   
 需要 win32-api gem，如果你的 ruby 不是官方 1.8.x 二进制，安装 win32-api gem 前记得先把编译器环境设好。

   
 一般 ocra 一个文件就行了（例如你要打包一个 rails app 的话，就去 ocra.rb.bat script\server）
有些依赖关系不能通过 require 或者 load 体现，得手动添加。例子：（添加图片和一个目录） 
Cosole代码 
ocra.rb.bat mainscript.rb someimage.jpeg docs/  


   
 对于 GUI 程序，在 main loop 之前加个判断，避免在打包过程中启动程序弹出窗口：
Ruby代码 
unless defined? Ocra  
  app.main_loop  
end  


   
 注意工作目录，最简易的手段是加上
Ruby代码 
Dir.chdir File.dirname __FILE__  


   
 某些情况可能需要 mingw 编译 stub，所以到 http://rubyinstaller.org/downloads/ 下载一个 devkit 可以有备无患。


可用选项： 
Options代码 
--dll dllname    将额外的 dll 包含进 bin 目录  
--no-lzma        取消可执行文件的 LZMA 压缩（体积大一点，运行是否快一点就看你硬盘不是/是 SSD 了）  
--quiet          格林..达姆自己  
--help           显示帮助  
--windows        产生窗口程序（rubyw.exe）  
--console        产生控制台程序（ruby.exe）  
--no-autoload    不预先加载/包含脚本文件的 autoloads（感觉对速度没什么影响）  
--icon <ico>     自定图标  
--version        显示版本号  


* Ruby trick

http://www.javaeye.com/topic/414412

<#+BEGIN_SRC >
match, text, number = * "Something 981".match(/([A-z]*) ([0-9]*)/)  
#+END_SRC

hash作参数： 

Ruby代码 
<#+BEGIN_SRC >
def m option={}  
  arg2 = option[:arg2]  
  arg1 = option[:arg1]  
  print arg2,arg1  
end  
  
m :arg2 =>"Hi", :arg1 = > "hooopo"  
 #Hihooopo  

#+END_SRC

* JRuby

jruby -S gem install antwrap 


[[http://wiki.jruby.org/wiki/html/Running_Rails_with_ActiveRecord-JDBC][Jruby on rails]]


* DB2 
this version run gem install ibm_db on Windows. On Linux run the following:
<#+BEGIN_SRC >
$ . /home/db2inst1/db2profile
$ export IBM_DB_DIR=/opt/ibm/db2/V9.5
$ export IBM_DB_LIB=/opt/ibm/db2/V9.5/lib32
$ sudo gem install ibm_db
#+END_SRC
* GUI

http://shoooes.net/

* mail

<#+BEGIN_SRC >
require 'rubygems' 
require 'action_mailer' 
require 'mime/types' 

ActionMailer::Base.smtp_settings = { :address  =>   
'10.209.3.26', :domain => '3dlabs.com'} 

class Mailer < ActionMailer::Base 
        def message (title, body) 
                from 'Dave Baldwin <dave.baldwin@...>' 
                recipients 'dave.baldwin@...' 
                subject        title 
                body body 

                # Include all the pdf files in the PDF subdirectory as attachments. 
                FileList['PDF/*.pdf'].each do |path| 
                        file = File.basename(path) 
                        mime_type = MIME::Types.of(file).first 
                        content_type = mime_type ? mime_type.content_type : 'application/ 
binary' 
                        attachment (content_type) do |a| 
                                a.body = File.read(path) 
                                a.filename = file 
                                a.transfer_encoding = 'quoted-printable' if content_type =~ /^text 
\// 
                        end 
                end 
        end 
end 

Mailer.deliver_message('some title', 'the body message') 

#+END_SRC


* passing parameter to ruby main

#+BEGIN_SRC
if ARGV.size != 1
  puts "Usage: gencr time  15:00 or \"3/4 15:00\""
  exit
end


copyfilesbefore ARGV[0]
#+END_SRC

* Time

#+BEGIN_SRC
    Time.local(2008, 3, 5, 11, 20, 00)
    # Suppose it is "Thu Nov 29 14:33:20 GMT 2001" now and
    # your timezone is GMT:
    Time.parse("16:30")     #=> Thu Nov 29 16:30:00 GMT 2001
    Time.parse("7/23")      #=> Mon Jul 23 00:00:00 GMT 2001
    Time.parse("Aug 31")    #=> Fri Aug 31 00:00:00 GMT 2001
#+END_SRC

* audio file

http://ruby-audiofile.sourceforge.net/

http://id3lib-ruby.rubyforge.org/

[[http://mp3splt.sourceforge.net/mp3splt_page/home.php][http://mp3splt.sourceforge.net/mp3splt_page/home.php]]

* Ruby web test framework


 1. [[http://watirwebdriver.com/][Watir WebDriver]]

sudo apt-get install curl git-core

bash -s stable < <(curl -s https://raw.github.com/wayneeseguin/rvm/master/binscripts/rvm-installer )

rvm pkg install openssl

rvm install 1.9.3-p125 --with-openssl-dir=$rvm_path/usr



HomePage http://wiki.openqa.org/dashboard.action

http://wtr.rubyforge.org/install.html

http://code.google.com/p/tg4rb/

<#+BEGIN_SRC >
require 'rubygems'
require 'firewatir' 
#+END_SRC


You need install firefox plugin too.


Unit test sample code is in the /var/lib/gems/1.8/gems/firewatir-1.6.2/unittests

http://wiki.openqa.org/display/WTR/Tutorial

** [[http://wiki.openqa.org/display/WTR/Cheat+Sheet][Cheat Sheet]]

*** Getting Started

Load the Watir library

#+BEGIN_SRC
require 'watir'
#+END_SRC

Open a browser (default: Internet Explorer)

#+BEGIN_SRC
browser = Watir::Browser.new
#+END_SRC

Open Browser at the specified URL
#+BEGIN_SRC
browser = Watir::Browser.start("http://google.com")
#+END_SRC

Go to a specified URL
#+BEGIN_SRC
browser.goto("http://amazon.com")
#+END_SRC

Close the browser
#+BEGIN_SRC
browser.close
#+END_SRC
	
*** Browser options (IE only)

Speed up execution
(or use the "-b" command line switch)
#+BEGIN_SRC
browser.speed = :fast
#+END_SRC

Maximize browser window
#+BEGIN_SRC
browser.maximize
#+END_SRC

Pop browser window to front
#+BEGIN_SRC
browser.bring_to_front
#+END_SRC

