wiki/html/ruby/index.html


<div id="outline-container-sec-7" class="outline-2">
<h2 id="sec-7">Ruby to exe</h2>
<div class="outline-text-2" id="text-7">
<p>
<a href="http://rubyforge.org/projects/ocra">http://rubyforge.org/projects/ocra</a> 
</p>

<p>
<a href="http://github.com/larsch/ocra">http://github.com/larsch/ocra</a> 
</p>

<p>
（水果党和 linuser 先站一边去 ……） 
One-Click Ruby Application，就是把解释器、gem 什么的打包在一起做成独立 exe。 
  比 rubyscript2exe 和 exerb 先进，支持 1.9。 
</p>

<p>
安装： 
Console代码 
gem install ocra  
</p>

<p>
或者下载 stand alone not complex 的 .exe 
</p>

<p>
假设要把 testo.rb 做成 exe，只需： 
Console代码 
ocra.rb.bat testo.rb  
</p>


<p>
输出看起来像这样（它把用到的东西都打包到 exe 里面了）： 
<code>=</code> Loading script to check dependencies 
testo vooo 
<code>=</code> Building testo.exe 
m #+BEGIN_SRC  
a #+BEGIN_SRC  
m bin 
a bin\ruby.exe 
a bin\msvcr100-ruby191.dll 
a bin\MSVCR100.dll 
m lib 
m lib\ruby 
m lib\ruby\1.9.1 
m lib\ruby\1.9.1\i386-mswin32_100 
m lib\ruby\1.9.1\i386-mswin32_100\enc 
a lib\ruby\1.9.1\i386-mswin32_100\enc\encdb.so 
a lib\ruby\1.9.1\i386-mswin32_100\enc\euc_kr.so 
a lib\ruby\1.9.1\i386-mswin32_100\enc\gb2312.so 
m lib\ruby\1.9.1\i386-mswin32_100\enc\trans 
a lib\ruby\1.9.1\i386-mswin32_100\enc\trans\transdb.so 
a lib\ruby\1.9.1\i386-mswin32_100\enc\gbk.so 
a lib\ruby\1.9.1\rubygems.rb 
e RUBYOPT rubygems 
e RUBYLIB 
l bin\ruby.exe ruby.exe  \#+BEGIN_SRC  
<code>=</code> Compressing 
<code>=</code> Finished (Final size was 781622) - 只有 781k 的 standalone 
</p>

<p>
一些琐碎的东西： 
</p>


<p>
 ocra 之前，路径变量中应该包含 ruby_home\bin，ocra 是根据 path 中找到的第一个 ruby 解释器来决定库文件位置的。设定路径变量例：
Console代码 
set path=d:\Ruby\ruby1.9.1\bin;%path%  
</p>



<p>
需要 win32-api gem，如果你的 ruby 不是官方 1.8.x 二进制，安装 win32-api gem 前记得先把编译器环境设好。
</p>


<p>
 一般 ocra 一个文件就行了（例如你要打包一个 rails app 的话，就去 ocra.rb.bat script\server）
有些依赖关系不能通过 require 或者 load 体现，得手动添加。例子：（添加图片和一个目录） 
Cosole代码 
ocra.rb.bat mainscript.rb someimage.jpeg docs/  
</p>



<p>
 对于 GUI 程序，在 main loop 之前加个判断，避免在打包过程中启动程序弹出窗口：
Ruby代码 
unless defined? Ocra  
  app.main_loop  
end  
</p>



<p>
 注意工作目录，最简易的手段是加上
Ruby代码 
Dir.chdir File.dirname <span class="underline"><span class="underline">FILE</span></span>  
</p>



<p>
某些情况可能需要 mingw 编译 stub，所以到 <a href="http://rubyinstaller.org/downloads/">http://rubyinstaller.org/downloads/</a> 下载一个 devkit 可以有备无患。
</p>


<p>
可用选项： 
Options代码 
--dll dllname    将额外的 dll 包含进 bin 目录  
--no-lzma        取消可执行文件的 LZMA 压缩（体积大一点，运行是否快一点就看你硬盘不是/是 SSD 了）  
--quiet          格林..达姆自己  
--help           显示帮助  
--windows        产生窗口程序（rubyw.exe）  
--console        产生控制台程序（ruby.exe）  
--no-autoload    不预先加载/包含脚本文件的 autoloads（感觉对速度没什么影响）  
--icon &lt;ico&gt;     自定图标  
--version        显示版本号  
</p>
</div>
</div>


<div id="outline-container-sec-8" class="outline-2">
<h2 id="sec-8">Ruby trick</h2>
<div class="outline-text-2" id="text-8">
<p>
<a href="http://www.javaeye.com/topic/414412">http://www.javaeye.com/topic/414412</a>
</p>

<p>
&lt;#+BEGIN_SRC &gt;
match, text, number = * "Something 981".match(<i>([A-z]*) ([0-9]*)</i>)  
#+END_SRC
</p>

<p>
hash作参数： 
</p>

<p>
Ruby代码 
&lt;#+BEGIN_SRC &gt;
def m option={}  
  arg2 = option[:arg2]  
  arg1 = option[:arg1]  
  print arg2,arg1  
end  
</p>

<p>
m :arg2 =&gt;"Hi", :arg1 = &gt; "hooopo"  
 #Hihooopo  
</p>

<p>
#+END_SRC
</p>
</div>
</div>

<div id="outline-container-sec-9" class="outline-2">
<h2 id="sec-9">JRuby</h2>
<div class="outline-text-2" id="text-9">
<p>
jruby -S gem install antwrap 
</p>


<p>
<a href="http://wiki.jruby.org/wiki/html/Running_Rails_with_ActiveRecord-JDBC">Jruby on rails</a>
</p>
</div>
</div>


<div id="outline-container-sec-10" class="outline-2">
<h2 id="sec-10">DB2</h2>
<div class="outline-text-2" id="text-10">
<p>
this version run gem install ibm_db on Windows. On Linux run the following:
&lt;#+BEGIN_SRC &gt;
$ . /home/db2inst1/db2profile
$ export IBM_DB_DIR=/opt/ibm/db2/V9.5
$ export IBM_DB_LIB=/opt/ibm/db2/V9.5/lib32
$ sudo gem install ibm_db
#+END_SRC
</p>
</div>
</div>
<div id="outline-container-sec-11" class="outline-2">
<h2 id="sec-11">GUI</h2>
<div class="outline-text-2" id="text-11">
<p>
<a href="http://shoooes.net/">http://shoooes.net/</a>
</p>
</div>
</div>

<div id="outline-container-sec-12" class="outline-2">
<h2 id="sec-12">mail</h2>
<div class="outline-text-2" id="text-12">
<p>
&lt;#+BEGIN_SRC &gt;
require 'rubygems' 
require 'action_mailer' 
require 'mime/types' 
</p>

<p>
ActionMailer::Base.smtp_settings = { :address  =&gt;   
'10.209.3.26', :domain =&gt; '3dlabs.com'} 
</p>

<p>
class Mailer &lt; ActionMailer::Base 
        def message (title, body) 
                from 'Dave Baldwin &lt;dave.baldwin@...&gt;' 
                recipients 'dave.baldwin@...' 
                subject        title 
                body body 
</p>

<p>
                FileList['PDF/*.pdf'].each do |path| 
                        file = File.basename(path) 
                        mime_type = MIME::Types.of(file).first 
                        content_type = mime_type ? mime_type.content_type : 'application/ 
binary' 
                        attachment (content_type) do |a| 
                                a.body = File.read(path) 
                                a.filename = file 
                                a.transfer_encoding = 'quoted-printable' if content_type =~ <i>^text 
\/</i> 
                        end 
                end 
        end 
end 
</p>

<p>
Mailer.deliver_message('some title', 'the body message') 
</p>

<p>
#+END_SRC
</p>
</div>
</div>


<div id="outline-container-sec-13" class="outline-2">
<h2 id="sec-13">passing parameter to ruby main</h2>
<div class="outline-text-2" id="text-13">
<pre class="example">
if ARGV.size != 1
  puts "Usage: gencr time  15:00 or \"3/4 15:00\""
  exit
end


copyfilesbefore ARGV[0]
</pre>
</div>
</div>

<div id="outline-container-sec-14" class="outline-2">
<h2 id="sec-14">Time</h2>
<div class="outline-text-2" id="text-14">
<pre class="example">
Time.local(2008, 3, 5, 11, 20, 00)
# Suppose it is "Thu Nov 29 14:33:20 GMT 2001" now and
# your timezone is GMT:
Time.parse("16:30")     #=&gt; Thu Nov 29 16:30:00 GMT 2001
Time.parse("7/23")      #=&gt; Mon Jul 23 00:00:00 GMT 2001
Time.parse("Aug 31")    #=&gt; Fri Aug 31 00:00:00 GMT 2001
</pre>
</div>
</div>

<div id="outline-container-sec-15" class="outline-2">
<h2 id="sec-15">audio file</h2>
<div class="outline-text-2" id="text-15">
<p>
<a href="http://ruby-audiofile.sourceforge.net/">http://ruby-audiofile.sourceforge.net/</a>
</p>

<p>
<a href="http://id3lib-ruby.rubyforge.org/">http://id3lib-ruby.rubyforge.org/</a>
</p>

<p>
<a href="http://mp3splt.sourceforge.net/mp3splt_page/home.php"><a href="http://mp3splt.sourceforge.net/mp3splt_page/home.php">http://mp3splt.sourceforge.net/mp3splt_page/home.php</a></a>
</p>
</div>
</div>

<div id="outline-container-sec-16" class="outline-2">
<h2 id="sec-16">Ruby web test framework</h2>
<div class="outline-text-2" id="text-16">
<ol class="org-ol">
<li><a href="http://watirwebdriver.com/">Watir WebDriver</a>
</li>
</ol>

<p>
sudo apt-get install curl git-core
</p>

<p>
bash -s stable &lt; &lt;(curl -s <a href="https://raw.github.com/wayneeseguin/rvm/master/binscripts/rvm-installer">https://raw.github.com/wayneeseguin/rvm/master/binscripts/rvm-installer</a> )
</p>

<p>
rvm pkg install openssl
</p>

<p>
rvm install 1.9.3-p125 --with-openssl-dir=$rvm_path/usr
</p>



<p>
HomePage <a href="http://wiki.openqa.org/dashboard.action">http://wiki.openqa.org/dashboard.action</a>
</p>

<p>
<a href="http://wtr.rubyforge.org/install.html">http://wtr.rubyforge.org/install.html</a>
</p>

<p>
<a href="http://code.google.com/p/tg4rb/">http://code.google.com/p/tg4rb/</a>
</p>

<p>
&lt;#+BEGIN_SRC &gt;
require 'rubygems'
require 'firewatir' 
#+END_SRC
</p>


<p>
You need install firefox plugin too.
</p>


<p>
Unit test sample code is in the /var/lib/gems/1.8/gems/firewatir-1.6.2/unittests
</p>

<p>
<a href="http://wiki.openqa.org/display/WTR/Tutorial">http://wiki.openqa.org/display/WTR/Tutorial</a>
</p>
</div>

<div id="outline-container-sec-16-1" class="outline-3">
<h3 id="sec-16-1"><a href="http://wiki.openqa.org/display/WTR/Cheat+Sheet">Cheat Sheet</a></h3>
<div class="outline-text-3" id="text-16-1">
</div><div id="outline-container-sec-16-1-1" class="outline-4">
<h4 id="sec-16-1-1">Getting Started</h4>
<div class="outline-text-4" id="text-16-1-1">
<p>
Load the Watir library
</p>

<pre class="example">
require 'watir'
</pre>

<p>
Open a browser (default: Internet Explorer)
</p>

<pre class="example">
browser = Watir::Browser.new
</pre>

<p>
Open Browser at the specified URL
</p>
<pre class="example">
browser = Watir::Browser.start("http://google.com")
</pre>

<p>
Go to a specified URL
</p>
<pre class="example">
browser.goto("http://amazon.com")
</pre>

<p>
Close the browser
</p>
<pre class="example">
browser.close
</pre>
</div>
</div>

<div id="outline-container-sec-16-1-2" class="outline-4">
<h4 id="sec-16-1-2">Browser options (IE only)</h4>
<div class="outline-text-4" id="text-16-1-2">
<p>
Speed up execution
(or use the "-b" command line switch)
</p>
<pre class="example">
browser.speed = :fast
</pre>

<p>
Maximize browser window
</p>
<pre class="example">
browser.maximize
</pre>

<p>
Pop browser window to front
</p>
<pre class="example">
browser.bring_to_front
</pre>
</div>
</div>
